{
  "id": "intermediate_balance",
  "name": {
    "en": "Intermediate Balance Flow",
    "zh": "中级平衡流"
  },
  "difficulty": 2,
  "duration": 750,
  "description": {
    "en": "This dynamic sequence focuses on balance, concentration and core strength for practitioners with some yoga experience. Challenge your stability through a series of standing and balancing poses that will help you develop greater body awareness and mental focus.",
    "zh": "这个动态序列专注于平衡、专注力和核心力量，适合有一定瑜伽经验的练习者。通过一系列站立和平衡姿势挑战你的稳定性，帮助你发展更强的身体意识和精神专注力。"
  },
  "poses": [
    {
      "id": "mountain_pose",
      "duration": 60,
      "breathCount": 5,
      "audioGuide": "pose_1_mountain_tadasa.mp3",
      "instructions": {
        "en": "Stand tall, engage all four corners of feet, lift through crown of head.",
        "zh": "挺身站立，四个脚角均匀用力，头顶向上延伸。"
      },
      "transitionHint": {
        "en": "Begin with a strong foundation, find your center and establish stability before moving into challenging positions.",
        "zh": "从强大的基础开始，找到你的中心，在进入具有挑战性的姿势前建立稳定性。"
      }
    },
    {
      "id": "tree_pose",
      "duration": 60,
      "breathCount": 5,
      "audioGuide": "pose_11_树式_vrksas.mp3",
      "instructions": {
        "en": "Shift weight to one foot, place other foot on inner thigh, bring hands to heart or overhead.",
        "zh": "重心移至一只脚，另一只脚放在大腿内侧，双手合十于胸前或上举。"
      },
      "transitionHint": {
        "en": "From Mountain Pose, slowly shift your weight to one foot and find a steady gaze point before lifting the other foot.",
        "zh": "从山式，慢慢将重心移至一只脚，在抬起另一只脚之前找到稳定的注视点。"
      }
    },
    {
      "id": "warrior_III",
      "duration": 60,
      "breathCount": 5,
      "audioGuide": "pose_188_战士三式_vira.mp3",
      "instructions": {
        "en": "Balance on one leg, hinge at hips, extend other leg back, arms forward or alongside body.",
        "zh": "单腿平衡，髋部铰链，另一条腿向后伸展，手臂向前或身体两侧。"
      },
      "transitionHint": {
        "en": "From Tree Pose, transition back to Mountain, then hinge forward from your hips as you extend one leg back.",
        "zh": "从树式，过渡回到山式，然后从髋部前折，同时将一条腿向后伸展。"
      }
    },
    {
      "id": "half_moon_pose",
      "duration": 45,
      "breathCount": 4,
      "audioGuide": "pose_197_半月式_ardha.mp3",
      "instructions": {
        "en": "Balance on one hand and foot, extend other leg parallel to floor, top arm reaches up.",
        "zh": "在一只手和一只脚上平衡，另一条腿与地板平行伸展，上臂向上伸展。"
      },
      "transitionHint": {
        "en": "From Warrior III, place your hand on the floor or a block, open your hip and chest to the side as you extend your top arm upward.",
        "zh": "从战士三式，将手放在地板或瑜伽砖上，打开髋部和胸部向侧面，同时将上臂向上伸展。"
      }
    },
    {
      "id": "dancer_pose",
      "duration": 45,
      "breathCount": 4,
      "audioGuide": "pose_425_舞王式_natar.mp3",
      "instructions": {
        "en": "Balance on one leg, bend opposite knee and hold foot with same-side hand, extend free arm forward.",
        "zh": "单腿平衡，弯曲对侧膝盖并用同侧手握住脚，自由手臂向前伸展。"
      },
      "transitionHint": {
        "en": "Return to Mountain Pose, then shift weight to one foot as you bend the opposite knee and reach back for your foot.",
        "zh": "回到山式，然后将重心移至一只脚，同时弯曲对侧膝盖并向后伸手握住脚。"
      }
    },
    {
      "id": "eagle_pose",
      "name": {
        "en": "Eagle Pose",
        "zh": "鹰式"
      },
      "duration": 45,
      "breathCount": 4,
      "audioGuide": "pose_434_鸟王式_garud.mp3",
      "instructions": {
        "en": "Cross one thigh over the other, wrap arms, sink hips slightly and find balance.",
        "zh": "一条大腿交叉在另一条上，缠绕手臂，髋部略微下沉并找到平衡。"
      },
      "transitionHint": {
        "en": "Return to Mountain Pose, then cross one thigh over the other as you wrap the same-side arm under the opposite arm.",
        "zh": "回到山式，然后将一条大腿交叉在另一条上，同时将同侧手臂缠绕在另一侧手臂下方。"
      }
    },
    {
      "id": "side_plank",
      "duration": 45,
      "breathCount": 4,
      "audioGuide": "pose_407_侧板式_vasis.mp3",
      "instructions": {
        "en": "Balance on one hand and the edge of one foot, stack feet, extend top arm upward.",
        "zh": "在一只手和一只脚边缘平衡，双脚堆叠，上臂向上伸展。"
      },
      "transitionHint": {
        "en": "From a regular plank position, roll onto the outer edge of one foot, stacking feet and lifting your top arm.",
        "zh": "从常规平板支撑位置，滚动到一只脚的外缘，堆叠双脚并抬起上臂。"
      }
    },
    {
      "id": "boat_pose",
      "duration": 45,
      "breathCount": 4,
      "audioGuide": "pose_115_船式_navasa.mp3",
      "instructions": {
        "en": "Balance on sitting bones, lift legs to create a V-shape with body, arms parallel to floor.",
        "zh": "在坐骨上平衡，抬起双腿与身体形成V形，手臂平行于地面。"
      },
      "transitionHint": {
        "en": "Come to a seated position, engage your core as you lean back slightly and lift your legs.",
        "zh": "来到坐姿，收紧核心，同时轻微向后倾斜并抬起双腿。"
      }
    },
    {
      "id": "corpse_pose",
      "duration": 90,
      "breathCount": 8,
      "audioGuide": "pose_470_挺尸式_savas.mp3",
      "instructions": {
        "en": "Lie flat on your back, arms at sides, palms up, and completely relax.",
        "zh": "平躺，手臂放在身体两侧，掌心向上，完全放松。"
      },
      "transitionHint": {
        "en": "Release all effort and surrender to gravity, allowing your body to absorb the benefits of your balance practice.",
        "zh": "释放所有努力，屈服于重力，让你的身体吸收平衡练习的益处。"
      }
    }
  ],
  "audioGuide": {
    "introduction": "audio/yoga-sessions/intermediate/balance_intro.mp3",
    "backgroundMusic": "audio/background/focused_flow.mp3"
  },
  "benefits": [
    {
      "en": "Develops advanced balance and coordination",
      "zh": "发展高级平衡能力和协调性"
    },
    {
      "en": "Strengthens stabilizing muscles throughout the body",
      "zh": "增强全身稳定肌肉"
    },
    {
      "en": "Improves mental focus and concentration",
      "zh": "提高精神专注力和集中力"
    },
    {
      "en": "Builds core and leg strength",
      "zh": "增强核心和腿部力量"
    }
  ]
}